espressif/esp-idf/components/soc/esp32c6/include/soc/lp_uart_struct.h
/** Group: Version Register */
/** Type of date register
 *  UART Version register
 */
typedef union {
    struct {
        /** date : R/W; bitpos: [31:0]; default: 35656288;
         *  This is the version register.
         */
        uint32_t date:32;
    };
    uint32_t val;
} lp_uart_date_reg_t;

/** Type of reg_update register
 *  UART Registers Configuration Update register
 */
typedef union {
    struct {
        /** reg_update : R/W/SC; bitpos: [0]; default: 0;
         *  Software write 1 would synchronize registers into UART Core clock domain and would
         *  be cleared by hardware after synchronization is done.
         */
        uint32_t reg_update:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lp_uart_reg_update_reg_t;

/** Type of id register
 *  UART ID register
 */
typedef union {
    struct {
        /** id : R/W; bitpos: [31:0]; default: 1280;
         *  This register is used to configure the uart_id.
         */
        uint32_t id:32;
    };
    uint32_t val;
} lp_uart_id_reg_t;


typedef struct lp_uart_dev_t {
    volatile lp_uart_fifo_reg_t fifo;
    volatile lp_uart_int_raw_reg_t int_raw;
    volatile lp_uart_int_st_reg_t int_st;
    volatile lp_uart_int_ena_reg_t int_ena;
    volatile lp_uart_int_clr_reg_t int_clr;
    volatile lp_uart_clkdiv_sync_reg_t clkdiv_sync;
    volatile lp_uart_rx_filt_reg_t rx_filt;
    volatile lp_uart_status_reg_t status;
    volatile lp_uart_conf0_sync_reg_t conf0_sync;
    volatile lp_uart_conf1_reg_t conf1;
    uint32_t reserved_028;
    volatile lp_uart_hwfc_conf_sync_reg_t hwfc_conf_sync;
    volatile lp_uart_sleep_conf0_reg_t sleep_conf0;
    volatile lp_uart_sleep_conf1_reg_t sleep_conf1;
    volatile lp_uart_sleep_conf2_reg_t sleep_conf2;
    volatile lp_uart_swfc_conf0_sync_reg_t swfc_conf0_sync;
    volatile lp_uart_swfc_conf1_reg_t swfc_conf1;
    volatile lp_uart_txbrk_conf_sync_reg_t txbrk_conf_sync;
    volatile lp_uart_idle_conf_sync_reg_t idle_conf_sync;
    volatile lp_uart_rs485_conf_sync_reg_t rs485_conf_sync;
    volatile lp_uart_at_cmd_precnt_sync_reg_t at_cmd_precnt_sync;
    volatile lp_uart_at_cmd_postcnt_sync_reg_t at_cmd_postcnt_sync;
    volatile lp_uart_at_cmd_gaptout_sync_reg_t at_cmd_gaptout_sync;
    volatile lp_uart_at_cmd_char_sync_reg_t at_cmd_char_sync;
    volatile lp_uart_mem_conf_reg_t mem_conf;
    volatile lp_uart_tout_conf_sync_reg_t tout_conf_sync;
    volatile lp_uart_mem_tx_status_reg_t mem_tx_status;
    volatile lp_uart_mem_rx_status_reg_t mem_rx_status;
    volatile lp_uart_fsm_status_reg_t fsm_status;
    uint32_t reserved_074[5];
    volatile lp_uart_clk_conf_reg_t clk_conf;
    volatile lp_uart_date_reg_t date;
    volatile lp_uart_afifo_status_reg_t afifo_status;
    uint32_t reserved_094;
    volatile lp_uart_reg_update_reg_t reg_update;
    volatile lp_uart_id_reg_t id;
} lp_uart_dev_t;

// We map the LP_UART instance to the uart_dev_t struct for convenience of using the same HAL/LL. See soc/uart_struct.h
// extern lp_uart_dev_t LP_UART;

#ifndef __cplusplus
_Static_assert(sizeof(lp_uart_dev_t) == 0xa0, "Invalid size of lp_uart_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
